Repository: FanapPlus-OpenSource/hr-plus
Catalog: jobs/locale/*/LC_MESSAGES/django.po
Languages: fa_ir

source: Applied
fa_ir: اپلای شده

source: Under Evaluation
fa_ir: در دست بررسی

source: Accepted for First Interview
fa_ir: قبول شده برای مصاحبه اول

source: Accepted for Second Interview
fa_ir: قبول شده برای مصاحبه دوم

source: Accepted for Third Interview
fa_ir: قبول شده برای مصاحبه سوم

source: Rejected
fa_ir: رد شده

source: Offer
fa_ir: پیشنهاد ارسال شده

source: Canceled
fa_ir: کنسل شده

source: Phone number must be entered in the format: '09112222222'.
fa_ir: شماره تلقن باید بصورت '09112222222' باشد.

source: The file is not a valid PDF file.
fa_ir: این فایل یک فایل PDF معتبر نمی‌باشد.
