Repository: FanapPlus-OpenSource/hr-plus
Catalog: app/locale/*/LC_MESSAGES/django.po
Languages: fa_ir

source: Invalid basic header. No credentials provided.
fa_ir: هدر نامعتبر است. اطلاعاتی داده نشده.

source: Invalid basic header. Credentials string should not contain spaces.
fa_ir: هدر نامعتبر است. اطلاعات نباید شامل فاصله باشد.

source: Invalid basic header. Credentials not correctly base64 encoded.
fa_ir: هدر نامعتبر است. اطلاعات به درستی base64 encode نشده‌اند.

source: Invalid username/password.
fa_ir: نام کاربری/کلمه عبور اشتباه است.

source: User inactive or deleted.
fa_ir: کاربر غیرفال یا پاک شده است.

source: Invalid token header. No credentials provided.
fa_ir: توکن داخل هدر نامعتبر است. هیچ اطلاعاتی داده نشده.

source: Invalid token header. Token string should not contain spaces.
fa_ir: توکن داخل هدر اشتباه است. توکن نباید شامل فاصله باشد.

source: Invalid token header. Token string should not contain invalid characters.
fa_ir: توکن داخل هدر نامعتبر است. توکن نباید شامل کاراکترهای نامعتبر باشد.

source: Invalid token.
fa_ir: توکن نامعتبر است.

source: Auth Token
fa_ir: توکن احراز هویت

source: Key
fa_ir: کلید

source: User
fa_ir: کاربر

source: Created
fa_ir: ایجاد

source: Token
fa_ir: توکن

source: Tokens
fa_ir: توکن‌ها

source: Username
fa_ir: نام کاربری

source: Password
fa_ir: کلمه عبور

source: User account is disabled.
fa_ir: اکانت کاربری غیرفعال است.

source: Unable to log in with provided credentials.
fa_ir: قادر به ورود با اطلاعات داده شده نمی‌باشد.

source: Must include "username" and "password".
fa_ir: باید شامل "نام کاربری" و "کلمه عبور" باشد.

source: A server error occurred.
fa_ir: خطای سرور اتفاق افتاد.

source: Malformed request.
fa_ir: درخواست ناقص.

source: Incorrect authentication credentials.
fa_ir: اطلاعات احراز هویت نامعتبر.

source: Authentication credentials were not provided.
fa_ir: اطلاعات احراز هویت داده نشده است.

source: You do not have permission to perform this action.
fa_ir: شما مجوز انجام این کار را ندارید.

source: Not found.
fa_ir: یافت نشد.

source: Method "{method}" not allowed.
fa_ir: متد "{method}" مجاز نمی‌باشد.

source: Could not satisfy the request Accept header.
fa_ir: قادر به انجام هدر Accept نمی‌باشد.

source: Unsupported media type "{media_type}" in request.
fa_ir: نوع مدیا "{media_type}" در درخواست قابل پشتیبانی نیست.

source: Request was throttled.
fa_ir: درخواست با محدودیت throttling مواجه است.

source: This field is required.
fa_ir: این فیلد اجباری است.

source: This field may not be null.
fa_ir: این فیلد نمی‌تواند null باشد.

source: "{input}" is not a valid boolean.
fa_ir: "{input}" یک مقدار boolean صحیح نمی‌باشد.

source: This field may not be blank.
fa_ir: این فیلد نمی‌تواند خالی باشد.

source: Ensure this field has no more than {max_length} characters.
fa_ir: مطمین شوید که تعداد کاراکترهای این فیلد بیشتر از {max_length} نمی‌باشد.

source: Ensure this field has at least {min_length} characters.
fa_ir: مطمین شوید که این فیلد حداقل {min_length} کاراکتر دارد.

source: Enter a valid email address.
fa_ir: یک آدرس ایمیل صحیح وارد کنید.

source: This value does not match the required pattern.
fa_ir: این مقدار با الگو همخوانی ندارد.

source: Enter a valid "slug" consisting of letters, numbers, underscores or hyphens.
fa_ir: یک "slug" معتبر شامل حروف، اعداد، آندرلاین و خظ تیره وارد کنید.

source: Enter a valid URL.
fa_ir: یک آدرس اینترنتی معتبر وارد کنید.

source: "{value}" is not a valid UUID.
fa_ir: "{value}" یک UUID معتبر نمی‌باشد.

source: Enter a valid IPv4 or IPv6 address.
fa_ir: یک آدرس IPv4 و IPv6 معتبر وارد کنید.

source: A valid integer is required.
fa_ir: یک مقدار عدد صحیح معتبر نیاز است.

source: Ensure this value is less than or equal to {max_value}.
fa_ir: مطمین شوید که این مقدار کوچکتر یا مساوی {max_value} باشد.

source: Ensure this value is greater than or equal to {min_value}.
fa_ir: مطمین شوید که این مقدار بزرگتر یا مساوی {min_value} باشد.

source: String value too large.
fa_ir: مقدار رشته بیش از اندازه بزرگ است.

source: A valid number is required.
fa_ir: یک عدد معتبر نیاز است.

source: Ensure that there are no more than {max_digits} digits in total.
fa_ir: مظمین شوید که در کل بیشتر از {max_digits} رقم وجود ندارد.

source: Ensure that there are no more than {max_decimal_places} decimal places.
fa_ir: مطمین شوید که بیشتر از {max_decimal_places} رقم اعشار وجود ندارد.

source: Ensure that there are no more than {max_whole_digits} digits before the decimal point.
fa_ir: مطمین شوید که بیشتر از {max_whole_digits} رقم قبل از اعشار وجود ندارد.

source: Datetime has wrong format. Use one of these formats instead: {format}.
fa_ir: قالب تاریخ و زمان صحیح نمی‌باشد. از یکی از قالب‌های {format} استفاده کنید.

source: Expected a datetime but got a date.
fa_ir: باید تاریخ و زمان وارد میشد اما تاریخ وارد شده است.

source: Date has wrong format. Use one of these formats instead: {format}.
fa_ir: قالب تاریخ صحیح نمی‌باشد. از یکی از قالب‌های {format} استفاده کنید.

source: Expected a date but got a datetime.
fa_ir: باید تاریخ وارد میشد اما تاریخ و زمان وارد شده است.

source: Time has wrong format. Use one of these formats instead: {format}.
fa_ir: قالب زمان صحیح نمی‌باشد. از یکی از قالب‌های {format} استفاده کنید.

source: Duration has wrong format. Use one of these formats instead: {format}.
fa_ir: قالب مدت زمان صحیح نمی‌باشد. از یکی از قالب‌های {format} استفاده کنید.

source: "{input}" is not a valid choice.
fa_ir: "{input}" یک گزینه مجاز نمی‌باشد.

source: More than {count} items...
fa_ir: بیشتر از {count} مورد...

source: Expected a list of items but got type "{input_type}".
fa_ir: یک لیست از موارد باید وارد میشد اما نوع "{input_type}" وارد شده.

source: This selection may not be empty.
fa_ir: این بخش نمی‌تواند خالی باشد.

source: "{input}" is not a valid path choice.
fa_ir: "{input}" یک path choice معتبر نمی‌باشد.

source: No file was submitted.
fa_ir: هیچ فایلی ارسال نشده.

source: The submitted data was not a file. Check the encoding type on the form.
fa_ir: داده‌ه ارسال شده یک فایل نمی‌باشد. نوع encoding فرم را چک کنید.

source: No filename could be determined.
fa_ir: هیج filename قابل تشخیص نیست.

source: The submitted file is empty.
fa_ir: فایل ارسال شده خالی است.

source: Ensure this filename has at most {max_length} characters (it has {length}).
fa_ir: مطمین شوید که این filename حداکثر {max_length} کاراکتر دارد (مقدار کنونی شامل {length} کاراکتر است).

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
fa_ir: یک تصویر معتبر بارگذاری کنید. فایلی که بارگذاری کرده‌اید یا تصویر نیست یا یک تصویر خراب است.

source: This list may not be empty.
fa_ir: این لیست نمی‌تواند خالی باشد.

source: Expected a dictionary of items but got type "{input_type}".
fa_ir: باید یک dictionary از موارد وارد میشد اما "{input_type}" وارد شده است.

source: Value must be valid JSON.
fa_ir: مقدار باید یک JSON معتبر باشد.

source: Submit
fa_ir: ارسال

source: ascending
fa_ir: صعودی

source: descending
fa_ir: نزولی

source: Invalid page.
fa_ir: صفحه نامعتبر.

source: Invalid cursor
fa_ir: مکان نما نامعتبر

source: Invalid pk "{pk_value}" - object does not exist.
fa_ir: کلید اصلی نامعتر "{pk_value}" - آبجکت وجود ندارد.

source: Incorrect type. Expected pk value, received {data_type}.
fa_ir: نوع نامعتبر. باید مقدار کلید اصلی وارد میشد، {data_type} وارد شده است.

source: Invalid hyperlink - No URL match.
fa_ir: لینک نامعتبر - هیج آدرس اینترنتی قایل انطباق نیست.

source: Invalid hyperlink - Incorrect URL match.
fa_ir: لینک نامعتبر - آدرس اینترنتی صحیحی قابل انطباق نیست.

source: Invalid hyperlink - Object does not exist.
fa_ir: لینک نامعتبر - آبجکت وجود ندارد.

source: Incorrect type. Expected URL string, received {data_type}.
fa_ir: نوع نامعتبر. باید یک رشته آدرس اینترنتی وارد میشد، {data_type} وارد شده است.

source: Object with {slug_name}={value} does not exist.
fa_ir: آبجکت با {slug_name}={value} وجود ندارد.

source: Invalid value.
fa_ir: مقدار نامعتیر.

source: Invalid data. Expected a dictionary, but got {datatype}.
fa_ir: داده نامعتبر. باید یک dictionary وارد میشد، اما {datatype} وارد شده است.

source: Filters
fa_ir: فیلتر‌ها

source: Field filters
fa_ir: فیلترهای فیلد

source: Ordering
fa_ir: مرتب‌سازی

source: Search
fa_ir: جستجو

source: None
fa_ir: هیچکدام

source: No items to select.
fa_ir: هیچ آیتمی برای انتخاب وجود ندارد.

source: This field must be unique.
fa_ir: این فیلد باید منحصر به فرد باشد.

source: The fields {field_names} must make a unique set.
fa_ir: فیلدهای {field_names} باید یک مجموعه منحصر به فرد بسازند.

source: This field must be unique for the "{date_field}" date.
fa_ir: این فیلد باید برای تاریخ "{date_field}" منحصر به فرد باشد.

source: This field must be unique for the "{date_field}" month.
fa_ir: این فیلد باید برای ماه "{date_field}" منحصر به فرد باشد.

source: This field must be unique for the "{date_field}" year.
fa_ir: این فیلد باید برای سال "{date_field}" منحصر به فرد باشد.

source: Invalid version in "Accept" header.
fa_ir: ورژن داخل هدر "Accept" نامعتبر است.

source: Invalid version in URL path.
fa_ir: ورژن داخل آدرس اینترنتی نامعتبر است.

source: Invalid version in URL path. Does not match any version namespace.
fa_ir: ورژن داخل آدرس اینترنتی نامعتبر است. با هیج یک از namespace‌های ورژن قابل انطباق نیست.

source: Invalid version in hostname.
fa_ir: ورژن داخل hostname نامعتبر است.

source: Invalid version in query parameter.
fa_ir: ورژن داخل query parameter نامعتبر است.

source: Permission denied.
fa_ir: اجازه دسترسی ندارید.

source: Authorization header must contain two space-delimited values
fa_ir: هدر اعتبارسنجی باید شامل دو مقدار جدا شده با فاصله باشد

source: Given token not valid for any token type
fa_ir: توکن داده شده برای هیچ نوع توکنی معتبر نمی‌باشد

source: Token contained no recognizable user identification
fa_ir: توکن شامل هیچ شناسه قابل تشخیصی از کاربر نیست

source: User not found
fa_ir: کاربر یافت نشد

source: User is inactive
fa_ir: کاربر غیرفعال است

source: Unrecognized algorithm type '{}'
fa_ir: نوع الگوریتم ناشناخته '{}'

source: Token is invalid or expired
fa_ir: توکن نامعتبر است یا منقضی شده است

source: No active account found with the given credentials
fa_ir: هیچ اکانت فعالی برای اطلاعات داده شده یافت نشد

source: The '{}' setting has been removed. Please refer to '{}' for available settings.
fa_ir: تنظیمات '{}' حذف شده است. لطفا به '{}' برای تنظیمات موجود مراجعه کنید.

source: user
fa_ir: کاربر

source: created at
fa_ir: زمان ایجاد

source: expires at
fa_ir: زمان انقضا

source: Token Blacklist
fa_ir: لیست سیاه توکن

source: Cannot create token with no type or lifetime
fa_ir: توکن بدون هیچ نوع و طول عمر قابل ساخت نیست

source: Token has no id
fa_ir: توکن id ندارد

source: Token has no type
fa_ir: توکن نوع ندارد

source: Token has wrong type
fa_ir: توکن نوع اشتباهی دارد

source: Token has no '{}' claim
fa_ir: توکن دارای '{}' claim نمی‌باشد

source: Token '{}' claim has expired
fa_ir: '{}' claim توکن منقضی شده

source: Token is blacklisted
fa_ir: توکن به لیست سیاه رفته است
